{
    "proposal": [
        {
            "title": "Title of the speech",
            "description": "Tell me something to convince me that your proposal is very cool",
            "tags": [ "aspnet vnext", "nodejs", "ruby", "angulars" ],
            "author": {
                "firstname": "Ugo",
                "lastaname": "Lattanzi",
                "twitter": "@imperugo",
                "blog": "http://tostring.it",
                "bio": "Ugo is a programmer specialized in enterprise application, with focus in web applications, service oriented applications and, generally, in all the environments where scalability is a top priority. Thanks to the experience earned in the latest years, Ugo is now focused on technologies like ASP.NET MVC, NodeJS, Azure, NServiceBus Nhibernate and HTML5. Thanks to this passion in web development using ASP.NET MVC, Microsoft granted him the MVP Award in this technology. Speaker for the most important Italian communities, Author of several articles and co-organizer of the widely appreciated Web.NET European Conference in 2012. Away from keybord he's a bad snowboarder but a good father.",
                "avatarUrl": "https://avatars1.githubusercontent.com/u/758620?s=460"
            }
        },
        {
            "title": "Integrate Office 365 inside a MVC application",
            "description": "In this session we will demonstrate how easy it is to integrate inside an existing/new asp.net MVC application an Office 365 environment with the help of the Office 365 API, after that we will show through variuos code examples how easy is to interact with the users calendar, email and files. The session will also provided hints on how to do the same operations in a mobile application.",
            "tags": [ "aspnet mvc", "c#", "office365", "client dev" ],
            "author": {
                "firstname": "Giancarlo",
                "lastaname": "Lelli",
                "twitter": "@itsonlyGianca",
                "blog": "http://diaryofamsp.azurewebsites.net",
                "bio": "Giancarlo works at iCubed srl where he provides consulting, training and software development of Microsoft related technologies with a special focus on .Net technologies and Office 365 solutions. It’s currently enrolled at the Cagliari University in the IT faculty, and he has been in the Italian team of the Microsoft Student Partners for two years. Giancarlo holds seminars in universities regarding Microsoft technologies and development of .NET platform. Themes in his works are: development of client applications for Windows 8 and Windows Phone 8, Office 365 and Windows Azure. Giancarlo is also the founder of Italian Developer Connection an Italian user group dedicated to Microsoft technologies.",
                "avatarUrl": "https://media.licdn.com/media/p/2/005/042/2f4/2b90c23.jpg"
            }
        },
        {
            "title": "Meet the new kid on the block - Microsoft's new ASP.NET is going to rock your world",
            "description": "Imagine if you could write an ASP.NET application in notepad, compile it and run it on a Mac OS X. Imagine if you could mix and match WebForms, MVC and Web API within the project. How would you feel if you could create a faster, leaner and more memory efficient ASP.NET application that has been freed from the shackles of Microsoft and the .NET framework and all you need is your coding skills, a couple of NuGet packages and your imagination? If all these sound like a dream come true, then come join me for an introduction to Microsoft’s ASP.NET vNext and learn how to get started with the 'new kid on the block'",
            "tags": [ "aspnet5", "c#", "node.js", "open source" ],
            "author": {
                "firstname": "Christos",
                "lastaname": "Matskas",
                "twitter": "@christosmatskas",
                "blog": "https://cmatskas.com",
                "bio": "Christos is a software engineer with over 10 years of experience mainly focusing on the .NET stack. He is the founder of SoftwareLounge, a software consultancy firm, and co-founder of TowzieTyke, a mobile apps development company. Over the years he had the opportunity to work on some very high profile and interesting projects with great companies. He's passionate about coding and continuously strives to improve. He regularly presents to local user groups and conferences and loves speaking about technology, gadgets and code. He blogs and writes about programming regularly.",
                "avatarUrl": "https://secure.gravatar.com/christosmatskas"
            }
        },
        {
            "title": "Visual Studio Tips & Tricks: Becoming a Jedi Master",
            "description": "Is Visual Studio your default development environment (IDE)? Do you feel that you know all there is to know about it? Would you like to know how to unlock some of its hidden features in order to boost your productivity and code more efficiently? Visual Studio's powerful IDE comes crammed with lots of features that can suprise and amaze you. Join Christos Matskas as he showcases some invaluable tips and tricks to help you become a Visual Studio Jedi Master.",
            "tags": [ "visual studio 2013", "IDE", "tips&tricks", "productivity" ],
            "author": {
                "firstname": "Christos",
                "lastaname": "Matskas",
                "twitter": "@christosmatskas",
                "blog": "https://cmatskas.com",
                "bio": "Christos is a software engineer with over 10 years of experience mainly focusing on the .NET stack. He is the founder of SoftwareLounge, a software consultancy firm, and co-founder of TowzieTyke, a mobile apps development company. Over the years he had the opportunity to work on some very high profile and interesting projects with great companies. He's passionate about coding and continuously strives to improve. He regularly presents to local user groups and conferences and loves speaking about technology, gadgets and code. He blogs and writes about programming regularly.",
                "avatarUrl": "https://secure.gravatar.com/christosmatskas"
            }
        },
	      {
            "title": "Build modern JavaScript web applications",
            "description": "Modern JavaScript web applications need a reliable and effective delivery system that provides automation in the build process. In this session we will show how to setup and run a complete build and unit testing engine based on Gulp.JS and Karma",
            "tags": [ "JavaScript", "web app", "GulpJs", "build automation", "Karma", "Jasmine" ],
            "author": {
                "firstname": "Roberto",
                "lastaname": "Messora",
                "twitter": "@robymes",
                "blog": "http://blogs.ugidotnet.org/robymes",
                "bio": "Roberto Messora is a product manager and software architect for geospatial IT solutions based on ESRI, Microsoft .NET, and HTML5 technology stacks. In the last few years he has acquired a deep knowledge in Location Analytics and Geomarketing, delivering web applications and tools for a wide range of industries. He also believes in an effective and collaborative team environment, adopting modern ALM techniques and tools.",
                "avatarUrl": "https://avatars3.githubusercontent.com/u/4116754?v=3&s=460"
            }
        },
        {
              "title": "Create a single page web application with AngularJS",
              "description": "The last versions of HTML, CSS and JavaScript are quickly growing in popularity, transforming the future of the Web with a high level of user experience and without any proprietary plugin. AngularJS is a main actor of this new generation of libraries and frameworks. The purpose of this session will be show the architectural concepts of the framework for supporting the development of more productive, flexible, maintainable, and testable web applications.",
              "tags": [ "AngularJS", "javascript", "web app" ],
              "author": {
                  "firstname": "Antonio",
                  "lastaname": "Di Motta",
                  "twitter": "@dimotta",
                  "blog": "http://www.dimotta.net",
                  "bio": "Antonio Di Motta is an IT Project Engineer with over 15 years of experience and specialized in project engineering, analysis and design of software solutions about production and transportation.",
                  "avatarUrl": "https://secure.gravatar.com/antdimot"
              }
          }
    ]
}
