{
    "proposal": [
        {
            "title": "Title of the speech",
            "description": "Tell me something to convince me that your proposal is very cool",
            "tags": [
                "aspnet vnext",
                "nodejs",
                "ruby",
                "angulars"
            ],
            "author": {
                "firstname": "Ugo",
                "lastaname": "Lattanzi",
                "twitter": "@imperugo",
                "blog": "http://tostring.it",
                "bio": "Ugo is a programmer specialized in enterprise application, with focus in web applications, service oriented applications and, generally, in all the environments where scalability is a top priority. Thanks to the experience earned in the latest years, Ugo is now focused on technologies like ASP.NET MVC, NodeJS, Azure, NServiceBus Nhibernate and HTML5. Thanks to this passion in web development using ASP.NET MVC, Microsoft granted him the MVP Award in this technology. Speaker for the most important Italian communities, Author of several articles and co-organizer of the widely appreciated Web.NET European Conference in 2012. Away from keybord he's a bad snowboarder but a good father.",
                "avatarUrl": "https://avatars1.githubusercontent.com/u/758620?s=460"
            }
        },
        {
            "title": "You Can Have it Both Ways: Using Web Components in a React UI",
            "description": "Say that you really like how React.js works, and you are building the UI of your web application in React, using React components. But say that there is some Web Component around that is exactly what you need, and you'd like to use it (after all, that's the main point of web components: to be easily reusable). In this talk we'll see how you can have your cake and eat it too, reusing existing web components inside the React virtual DOM.",
            "tags": [
                "JavaScript",
                "React",
                "WebComponents",
                "SPA"
            ],
            "author": {
                "firstname": "Massimiliano",
                "lastaname": "Mantione",
                "twitter": "@M_a_s_s_1",
                "bio": "Massimiliano worked on the Mono JIT complier and for the Unity3d game engine. He started as a Javascript hater but changed his mind after he worked in the V8 team in Google for about one year and half. Now he works on virtual tradeshows in 3D on the web, and he implemented (and uses in production!) yet another programming language that compiles to Javascript: metascript.",
                "avatarUrl": "https://avatars3.githubusercontent.com/u/426352?s=200"
            }
        },
        {
            "title": "Transducers FTW!",
            "description": "Over time we have seen several utility frameworks for dealing with Javascript data structures and processing abstractions. It all started simple with Underscode, became more functional with Lodash, and reached the Next Level with Rambda. Then it got a bit messy when developers looked for a way out of callback hell, initially through promises and futures and then with one of the reactive frameworks like Rx, Bacon, Highland, Kefir... Then the Clojure world brought us transducers. They redefine the idea of processing a sequence encompassing the usual map, reduce, and filter functions, and can be applied to both synchronous and asynchronous computations. In this talk we will see how to use them in Javascript, and especially how they can help you writing better code.",
            "tags": [
                "JavaScript",
                "promises",
                "async",
                "reactive",
                "transducers"
            ],
            "author": {
                "firstname": "Massimiliano",
                "lastaname": "Mantione",
                "twitter": "@M_a_s_s_1",
                "bio": "Massimiliano worked on the Mono JIT complier and for the Unity3d game engine. He started as a Javascript hater but changed his mind after he worked in the V8 team in Google for about one year and half. Now he works on virtual tradeshows in 3D on the web, and he implemented (and uses in production!) yet another programming language that compiles to Javascript: metascript.",
                "avatarUrl": "https://avatars3.githubusercontent.com/u/426352?s=200"
            }
        },
        {
            "title": "Metascript: Beyond Javascript Limitations",
            "description": "There are a lot of languages that compile to Javascript, so creating another one is an effort hard to justify from a practical standpoint. Yet none of them provides what is really important for me, so I decided to do it: Metascript is la programming language that focuses on true Lisp-like metaprogramming, a clean and readable systax, embracing the Javascript platform and echosystem, and leaving the door open to optional static type checking. Of all these things metaprogramming is the least understood, so the talk will focus on how Lisp-like macros can transform an ordinary programmng language into an extremely practical tool to describe solutions to problems in a readable way.",
            "tags": [
                "JavaScript",
                "ES5",
                "ES6",
                "metaprogramming"
            ],
            "author": {
                "firstname": "Massimiliano",
                "lastaname": "Mantione",
                "twitter": "@M_a_s_s_1",
                "bio": "Massimiliano worked on the Mono JIT complier and for the Unity3d game engine. He started as a Javascript hater but changed his mind after he worked in the V8 team in Google for about one year and half. Now he works on virtual tradeshows in 3D on the web, and he implemented (and uses in production!) yet another programming language that compiles to Javascript: metascript.",
                "avatarUrl": "https://avatars3.githubusercontent.com/u/426352?s=200"
            }
        },
        {
            "title": "Integrate Office 365 inside a MVC application",
            "description": "In this session we will demonstrate how easy it is to integrate inside an existing/new asp.net MVC application an Office 365 environment with the help of the Office 365 API, after that we will show through variuos code examples how easy is to interact with the users calendar, email and files. The session will also provided hints on how to do the same operations in a mobile application.",
            "tags": [
                "aspnet mvc",
                "c#",
                "office365",
                "client dev"
            ],
            "author": {
                "firstname": "Giancarlo",
                "lastaname": "Lelli",
                "twitter": "@itsonlyGianca",
                "blog": "http://diaryofamsp.azurewebsites.net",
                "bio": "Giancarlo works at iCubed srl where he provides consulting, training and software development of Microsoft related technologies with a special focus on .Net technologies and Office 365 solutions. It’s currently enrolled at the Cagliari University in the IT faculty, and he has been in the Italian team of the Microsoft Student Partners for two years. Giancarlo holds seminars in universities regarding Microsoft technologies and development of .NET platform. Themes in his works are: development of client applications for Windows 8 and Windows Phone 8, Office 365 and Windows Azure. Giancarlo is also the founder of Italian Developer Connection an Italian user group dedicated to Microsoft technologies.",
                "avatarUrl": "https://media.licdn.com/media/p/2/005/042/2f4/2b90c23.jpg"
            }
        },
        {
            "title": "Meet the new kid on the block - Microsoft's new ASP.NET is going to rock your world",
            "description": "Imagine if you could write an ASP.NET application in notepad, compile it and run it on a Mac OS X. Imagine if you could mix and match WebForms, MVC and Web API within the project. How would you feel if you could create a faster, leaner and more memory efficient ASP.NET application that has been freed from the shackles of Microsoft and the .NET framework and all you need is your coding skills, a couple of NuGet packages and your imagination? If all these sound like a dream come true, then come join me for an introduction to Microsoft’s ASP.NET vNext and learn how to get started with the 'new kid on the block'",
            "tags": [
                "aspnet5",
                "c#",
                "node.js",
                "open source"
            ],
            "author": {
                "firstname": "Christos",
                "lastaname": "Matskas",
                "twitter": "@christosmatskas",
                "blog": "https://cmatskas.com",
                "bio": "Christos is a software engineer with over 10 years of experience mainly focusing on the .NET stack. He is the founder of SoftwareLounge, a software consultancy firm, and co-founder of TowzieTyke, a mobile apps development company. Over the years he had the opportunity to work on some very high profile and interesting projects with great companies. He's passionate about coding and continuously strives to improve. He regularly presents to local user groups and conferences and loves speaking about technology, gadgets and code. He blogs and writes about programming regularly.",
                "avatarUrl": "https://secure.gravatar.com/christosmatskas"
            }
        },
        {
            "title": "Visual Studio Tips & Tricks: Becoming a Jedi Master",
            "description": "Is Visual Studio your default development environment (IDE)? Do you feel that you know all there is to know about it? Would you like to know how to unlock some of its hidden features in order to boost your productivity and code more efficiently? Visual Studio's powerful IDE comes crammed with lots of features that can suprise and amaze you. Join Christos Matskas as he showcases some invaluable tips and tricks to help you become a Visual Studio Jedi Master.",
            "tags": [
                "visual studio 2013",
                "IDE",
                "tips&tricks",
                "productivity"
            ],
            "author": {
                "firstname": "Christos",
                "lastaname": "Matskas",
                "twitter": "@christosmatskas",
                "blog": "https://cmatskas.com",
                "bio": "Christos is a software engineer with over 10 years of experience mainly focusing on the .NET stack. He is the founder of SoftwareLounge, a software consultancy firm, and co-founder of TowzieTyke, a mobile apps development company. Over the years he had the opportunity to work on some very high profile and interesting projects with great companies. He's passionate about coding and continuously strives to improve. He regularly presents to local user groups and conferences and loves speaking about technology, gadgets and code. He blogs and writes about programming regularly.",
                "avatarUrl": "https://secure.gravatar.com/christosmatskas"
            }
        },
        {
            "title": "Build modern JavaScript web applications",
            "description": "Modern JavaScript web applications need a reliable and effective delivery system that provides automation in the build process. In this session we will show how to setup and run a complete build and unit testing engine based on Gulp.JS and Karma",
            "tags": [
                "JavaScript",
                "web app",
                "GulpJs",
                "build automation",
                "Karma",
                "Jasmine"
            ],
            "author": {
                "firstname": "Roberto",
                "lastaname": "Messora",
                "twitter": "@robymes",
                "blog": "http://blogs.ugidotnet.org/robymes",
                "bio": "Roberto Messora is a product manager and software architect for geospatial IT solutions based on ESRI, Microsoft .NET, and HTML5 technology stacks. In the last few years he has acquired a deep knowledge in Location Analytics and Geomarketing, delivering web applications and tools for a wide range of industries. He also believes in an effective and collaborative team environment, adopting modern ALM techniques and tools.",
                "avatarUrl": "https://avatars3.githubusercontent.com/u/4116754?v=3&s=460"
            }
        },
        {
            "title": "Create a single page web application with AngularJS",
            "description": "The latest versions of HTML, CSS and JavaScript are quickly growing in popularity, transforming the future of the Web with a rich and responsive user experience and without any proprietary plugins. AngularJS is a key driver of this new generation of libraries and frameworks. The purpose of this session will be to show the architectural concepts of the framework for supporting the development of more productive, flexible, maintainable and testable web applications.",
            "tags": [
                "AngularJS",
                "javascript",
                "web app"
            ],
            "author": {
                "firstname": "Antonio",
                "lastaname": "Di Motta",
                "twitter": "@dimotta",
                "blog": "http://www.dimotta.net",
                "bio": "Antonio Di Motta is an IT Project Engineer with over 15 years of experience specializing in project engineering, analysis and design of software solutions in the manufacturing and transport sectors.",
                "avatarUrl": "https://secure.gravatar.com/antdimot"
            }
        },
        {
            "title": "Your wish is my command",
            "description": "When it comes to speech recognition, the first name that comes to your mind is probably Siri. There are, however, great alternatives like Wit.ai, a platform-independent service which turns speech into actionable data. In the presentation I will show how to plan and build a Wit.ai powered Laravel 5 application that you can control with your voice.",
            "tags": [
                "Speech recognition",
                "javascript",
                "web app",
                "wit.ai"
            ],
            "author": {
                "firstname": "Donato",
                "lastaname": "Rotunno",
                "twitter": "@ralf57",
                "blog": "",
                "bio": "Donato Rotunno is Senior (mostly) Frontend Developer at Liip AG in Fribourg, Switzerland. Passionate about modern Frontend development and web technologies, he also likes to take great care about details and User Experience in general. His experience spreads from old-style-legacy Java applications to latest, cutting-edge MVC frontend frameworks like Backbone or Ember.js. When away from his laptop, you can find him playing football, coaching kids at football camps, shooting photography and having fun with his 2 kids and his wife.",
                "avatarUrl": "https://avatars1.githubusercontent.com/u/208237"
            }
        },
        {
            "title": "The Azure Cloud 3 Step Theorem",
            "description": "We all know that Azure is a multi-headed beast which can either be tamed or grow wild on you, your choice. But where do we start? And I do mean literally… where do we start looking on deciding which architecture that we’re going to need on our quest for glory. This decision session will guide you in your first steps on how to go from Minimal Control to Full Control but also with all the caveats mentioned. We’ll talk about on deciding on whether to use Azure Websites, Azure Cloud Services or Azure VM’s and your use for scalable architectures.",
            "tags": [
                "azure",
                "cloud",
                "web"
            ],
            "author": {
                "firstname": "Mike",
                "lastaname": "Martin",
                "twitter": "@techmike2kx",
                "blog": "http://techmike2kx.wordpress.com",
                "bio": "Mike is Microsoft Lead Consultant and Architect at Crosspoint Solutions (part of the Cronos group), a company with a strong focus on BI, Data and CRM. Mike is mainly focused on the complete Microsoft product stack and therefore very flexible to work with. He’s been active in the IT industry for over 15 years and has performed almost all types of job profiles, going from coaching and leading a team to architecting and systems design and training. Today he’s primarily into the Microsoft Cloud Platform and Application Lifecycle Management. He’s not a stranger to both dev and IT Pro topics. In January 2012 he became a crew member of AZUG, the Belgian Microsoft Azure User Group. As an active member he’s both involved in giving presentations and organizing events. Mike is also a Microsoft Azure MVP (already awarded twice) and Microsoft Azure Insider. Mike likes helping out in the community and introducing new & young people into the world of Microsoft and technology.",
                "avatarUrl": "http://s.gravatar.com/avatar/45efeb5bf94b522ac5807a33860525de?s=80"
            }
        },
        {
            "title": "Developing Microsoft Azure Websites with Visual Studio Online 'Monaco': because it’s mundane Monaco!",
            "description": "With Visual Studio Online or shortly VSO, Microsoft already offered a broad range of tools and services that support different kinds of development. To further build on that vision, Microsoft recently released a preview of “Monaco”, a new development service specifically designed for building and maintaining Microsoft Azure Websites. With Monaco, Microsoft provides developers with a lightweight, friction free companion to the Visual Studio IDE that is accessible from any device on any platform. It is a rich, browser based, code focused development environment optimized for the Microsoft Azure platform, making it easy to start building and maintaining applications for the cloud. In this session we will walk you through this exciting new Microsoft Azure service, show you how fast you can make changes in Monaco and how the online experience can speed up your development and offers you an even greater set of tools than the ones you already use every day. We will talk about more advanced scenarios, and show you how the extensions work, how you can leverage Git and TFS source control in combination with Monaco, and how you can even make live changes, compile them and have them reflected immediately online.",
            "tags": [
                "azure",
                "cloud",
                "web"
            ],
            "author": {
                "firstname": "Mike",
                "lastaname": "Martin",
                "twitter": "@techmike2kx",
                "blog": "http://techmike2kx.wordpress.com",
                "bio": "Mike is Microsoft Lead Consultant and Architect at Crosspoint Solutions (part of the Cronos group), a company with a strong focus on BI, Data and CRM. Mike is mainly focused on the complete Microsoft product stack and therefore very flexible to work with. He’s been active in the IT industry for over 15 years and has performed almost all types of job profiles, going from coaching and leading a team to architecting and systems design and training. Today he’s primarily into the Microsoft Cloud Platform and Application Lifecycle Management. He’s not a stranger to both dev and IT Pro topics. In January 2012 he became a crew member of AZUG, the Belgian Microsoft Azure User Group. As an active member he’s both involved in giving presentations and organizing events. Mike is also a Microsoft Azure MVP (already awarded twice) and Microsoft Azure Insider. Mike likes helping out in the community and introducing new & young people into the world of Microsoft and technology.",
                "avatarUrl": "http://s.gravatar.com/avatar/45efeb5bf94b522ac5807a33860525de?s=80"
            }
        },
        {
            "title": "The toolshed: Inside Microsoft Azure Tools : Your daily hammers",
            "description": "Visual Studio 2013, MSFT’s flagship was released in November 2013 and people just love it. With it came the new release of the online version and also one for Microsoft Azure integrated in WAWS. This doesn’t made the choice of tooling  easier on all of us. And thus maybe it’s about time to take a look what we can do with all the available tools and which tools are your best tools of the trade. And is there such a thing as “One Tool to rule’em all”? This session will hopefully enlighten your path to Microsoft Azure Tooling (for Dev, IT Pro and asset Management)SMALL Note: this session isn’t sponsored although it’s mostly about partner solutions! Some free software may be included.",
            "tags": [
                "azure",
                "cloud",
                "web",
                "tooling"
            ],
            "author": {
                "firstname": "Mike",
                "lastaname": "Martin",
                "twitter": "@techmike2kx",
                "blog": "http://techmike2kx.wordpress.com",
                "bio": "Mike is Microsoft Lead Consultant and Architect at Crosspoint Solutions (part of the Cronos group), a company with a strong focus on BI, Data and CRM. Mike is mainly focused on the complete Microsoft product stack and therefore very flexible to work with. He’s been active in the IT industry for over 15 years and has performed almost all types of job profiles, going from coaching and leading a team to architecting and systems design and training. Today he’s primarily into the Microsoft Cloud Platform and Application Lifecycle Management. He’s not a stranger to both dev and IT Pro topics. In January 2012 he became a crew member of AZUG, the Belgian Microsoft Azure User Group. As an active member he’s both involved in giving presentations and organizing events. Mike is also a Microsoft Azure MVP (already awarded twice) and Microsoft Azure Insider. Mike likes helping out in the community and introducing new & young people into the world of Microsoft and technology.",
                "avatarUrl": "http://s.gravatar.com/avatar/45efeb5bf94b522ac5807a33860525de?s=80"
            }
        },
        {
            "title": "Lights, Camera, Action - Microsoft Azure Media Services on the Loose",
            "description": "You just cannot imagine the Web without audio and video services. Up until now, if you want to include streaming media content in your websites or applications, you need to rely on third party services or massive computing capacity for media transcoding, and streaming to a range of client devices. With the release of Microsoft Azure Media Services and the Media Services SDK, these capabilities are becoming easily available for you to incorporate in your websites and applications. In this session we'll give an overview of Microsoft Azure Media Services, and you'll learn from a series of demos how you can take advantage of the platform to add media content to your development. We'll also see what the competition has in store and what's missing.",
            "tags": [
                "azure",
                "cloud",
                "web",
                "tooling",
                "media"
            ],
            "author": {
                "firstname": "Mike",
                "lastaname": "Martin",
                "twitter": "@techmike2kx",
                "blog": "http://techmike2kx.wordpress.com",
                "bio": "Mike is Microsoft Lead Consultant and Architect at Crosspoint Solutions (part of the Cronos group), a company with a strong focus on BI, Data and CRM. Mike is mainly focused on the complete Microsoft product stack and therefore very flexible to work with. He’s been active in the IT industry for over 15 years and has performed almost all types of job profiles, going from coaching and leading a team to architecting and systems design and training. Today he’s primarily into the Microsoft Cloud Platform and Application Lifecycle Management. He’s not a stranger to both dev and IT Pro topics. In January 2012 he became a crew member of AZUG, the Belgian Microsoft Azure User Group. As an active member he’s both involved in giving presentations and organizing events. Mike is also a Microsoft Azure MVP (already awarded twice) and Microsoft Azure Insider. Mike likes helping out in the community and introducing new & young people into the world of Microsoft and technology.",
                "avatarUrl": "http://s.gravatar.com/avatar/45efeb5bf94b522ac5807a33860525de?s=80"
            }
        },
        {
            "title": "Putting The CD In The CI With The GIT , The ALM And Other Acronyms That Don’t Make Sense When Putting Them All In One Phrase",
            "description": "We build, deploy, and redo the same thing over and over again. If we’re lucky we find ourselves an automated system (that’s what we all hope for as consultants that is  ) And that’s all ok , but what are the best practices when doing this in the Cloud? And where can Azure help us (in combo with others that is ). A journey into Continuous integration, delivery, lifecycle and releasemanagement.",
            "tags": [
                "azure",
                "cloud",
                "web",
                "tooling"
            ],
            "author": {
                "firstname": "Mike",
                "lastaname": "Martin",
                "twitter": "@techmike2kx",
                "blog": "http://techmike2kx.wordpress.com",
                "bio": "Mike is Microsoft Lead Consultant and Architect at Crosspoint Solutions (part of the Cronos group), a company with a strong focus on BI, Data and CRM. Mike is mainly focused on the complete Microsoft product stack and therefore very flexible to work with. He’s been active in the IT industry for over 15 years and has performed almost all types of job profiles, going from coaching and leading a team to architecting and systems design and training. Today he’s primarily into the Microsoft Cloud Platform and Application Lifecycle Management. He’s not a stranger to both dev and IT Pro topics. In January 2012 he became a crew member of AZUG, the Belgian Microsoft Azure User Group. As an active member he’s both involved in giving presentations and organizing events. Mike is also a Microsoft Azure MVP (already awarded twice) and Microsoft Azure Insider. Mike likes helping out in the community and introducing new & young people into the world of Microsoft and technology.",
                "avatarUrl": "http://s.gravatar.com/avatar/45efeb5bf94b522ac5807a33860525de?s=80"
            }
        },
        {
            "title": "Why Middleware?",
            "description": "OWIN has a concept of middleware. So does ASP.NET 5. Why? What is middleware? How does it help in typical web applications? In this talk we will dive into the code, write some middleware and show how middleware helps you handle cross-cutting concerns in an isolated and re-usable way. I'll compare and contrast the OWIN and ASP.NET 5 middleware concepts and talk about where each is appropriate.",
            "tags": [
                "OWIN",
                "ASPNET vNext",
                "web",
                "micro services"
            ],
            "author": {
                "firstname": "Christian",
                "lastaname": "Horsdal",
                "twitter": "@chr_horsdal",
                "blog": "http://www.horsdal-consult.dk",
                "bio": "Christian is an independent consultant, MS MVP for .NET, Nancy MVM, problem solver and single malt aficionado",
                "avatarUrl": "http://s.gravatar.com/avatar/0b16e1ac4e986b6dfc2c09571159c72f?s=80"
            }
        },
        {
            "title": "Layers Considered Harmful",
            "description": "Layers are killing us. All the time. They are killing our communication. They are killing our speed. They are killing the others speed as well. We need to do better. Which we can. I'll tell why layers are killing us. I might even tell you something about how to do better.",
            "tags": [
                "web",
                "micro services",
                "architecture"
            ],
            "author": {
                "firstname": "Christian",
                "lastaname": "Horsdal",
                "twitter": "@chr_horsdal",
                "blog": "http://www.horsdal-consult.dk",
                "bio": "Christian is an independent consultant, MS MVP for .NET, Nancy MVM, problem solver and single malt aficionado",
                "avatarUrl": "http://s.gravatar.com/avatar/0b16e1ac4e986b6dfc2c09571159c72f?s=80"
            }
        },
        {
            "title": "Advanced Nancy",
            "description": "In this hands-on session, we will take a look how to get beyond the basics and build secure and reliable application for the Real World with Nancy. In the process, we will get into authentication, authorization, input validation and error handling and swapping out defaults for custom implementations. All in a test-friendly manner following the Super Duper Happy Path of Nancy web application development.(Part of this material is covered in my book on the Nancy web framework, part of it goes beyond that.)",
            "tags": [
                "Nancy",
                "web"
            ],
            "author": {
                "firstname": "Christian",
                "lastaname": "Horsdal",
                "twitter": "@chr_horsdal",
                "blog": "http://www.horsdal-consult.dk",
                "bio": "Christian is an independent consultant, MS MVP for .NET, Nancy MVM, problem solver and single malt aficionado",
                "avatarUrl": "http://s.gravatar.com/avatar/0b16e1ac4e986b6dfc2c09571159c72f?s=80"
            }
        },
        {
            "title": "Azure Webjobs - the easiest way to use Azure",
            "description": "If you ever wanted to use the power of Azure for processing or loading data Azure WebJobs are the easiest option. In this talk I will show the features and possibilities of the different WebJobs flavors and how you can enhance existing applications without losing the capability to run it outside of Azure.",
            "tags": [
                "azure",
                "azure webjobs",
                "cloud",
                ".net"
            ],
            "author": {
                "firstname": "Robert",
                "lastaname": "Muehsig",
                "twitter": "@robert0muehsig",
                "blog": "http://blog.codeinside.eu",
                "bio": "Hi, my name is Robert Muehsig and I'm a software developer and live in Switzerland. My main focus is around web technologies and the Microsoft Stack. Since a couple of years I'm a ASP.NET MVP and always try to learn new stuff and help other people. And I like to travel, so... that's me.",
                "avatarUrl": "https://pbs.twimg.com/profile_images/1757756291/profile.png"
            }
        },
        {
            "title": "Sign in & co. with Azure Active Directory for your Mobile-, Desktop- or Web-App - the Facebook Login for the business world",
            "description": "In this talk I will show you how to enable 'Sign in with Azure Active Directory' for your Mobile, Desktop or Web-Applications. You need to secure Web APIs? No problem. You need an easy way to protect your Azure website? Yep. And after we made the first step, we will dig deeper to the Graph API and explore the connection between Azure Active Directory and Office 365.",
            "tags": [
                "azure",
                "azure active directory",
                "identity",
                "security",
                "office365"
            ],
            "author": {
                "firstname": "Robert",
                "lastaname": "Muehsig",
                "twitter": "@robert0muehsig",
                "blog": "http://blog.codeinside.eu",
                "bio": "Hi, my name is Robert Muehsig and I'm a software developer and live in Switzerland. My main focus is around web technologies and the Microsoft Stack. Since a couple of years I'm a ASP.NET MVP and always try to learn new stuff and help other people. And I like to travel, so... that's me.",
                "avatarUrl": "https://pbs.twimg.com/profile_images/1757756291/profile.png"
            }
        },
        {
            "title": "Mind the gap!",
            "description": "An unknown Mobile 'country'. A wandering developer from Web 'city'. No idea about how to deal with the 'droids', where getting great 'apples' to eat and what 'windows' would be opened to me. The only available means of transport: the express 'JavaScript' train, the most up-to-date 'Html' Tube and the confortable and safe 'CSS' Tram. Tension, drama, action and finally, love. This is my love story with cross-platform mobile frameworks. In this talk we'll speak about the existent cross-platform mobile frameworks, talking openly about weaknesses, strengths and myths present in cross platforms, from the point of view of a newbie mobile developer. Do you want to join me on this trip? This is your talk!",
            "tags": [
                "cross-platform",
                "mobile development",
                "phonegap"
            ],
            "author": {
                "firstname": "Alberto",
                "lastaname": "Lopez",
                "twitter": "@albertuslm",
                "blog": "http://albertolopezmartin.com/en",
                "bio": "Hi, I am Alberto Lopez and I work as EMEA Developer Advocate at Braintree_Dev and I live in Spain. I am passionate about innovation, mobility and Internet and commerce technologies. As an EMEA Developer Advocate at Braintree Dev, I look forward to opportunities to demonstrate how those crazy ideas we all have in mind can be turned into pragmatic solutions. Always learning new things, sharing experiences and knowledge with others, and everyday hungry for new challenges in the tech world; testing products, languages and in general, playing with tech and pushing what can be hacked to the limit.",
                "avatarUrl": "http://www.gravatar.com/avatar/b3e82acd2587daeaeb5c0d0fe288e97f.png"
            }
        },
        {
            "title": "web development beyond the Web: IoT",
            "description": "Over the latest years, the line between offline and online world becoming thinner, practically disappearing. Today, thanks to the new technologies, is possible take the control of all the things of your offline world using the power of the online world to enhance our daily business. Who didn’t ever feel that would be great having the APIs you use on the web available for your daily life? C’mon! Say hello to the fusion between Web and & IoT!",
            "tags": [
                "web development",
                "Internet of Things"
            ],
            "author": {
                "firstname": "Alberto",
                "lastaname": "Lopez",
                "twitter": "@albertuslm",
                "blog": "http://albertolopezmartin.com/en",
                "bio": "Hi, I am Alberto Lopez and I work as EMEA Developer Advocate at Braintree_Dev and I live in Spain. I am passionate about innovation, mobility and Internet and commerce technologies. As an EMEA Developer Advocate at Braintree Dev, I look forward to opportunities to demonstrate how those crazy ideas we all have in mind can be turned into pragmatic solutions. Always learning new things, sharing experiences and knowledge with others, and everyday hungry for new challenges in the tech world; testing products, languages and in general, playing with tech and pushing what can be hacked to the limit.",
                "avatarUrl": "http://www.gravatar.com/avatar/b3e82acd2587daeaeb5c0d0fe288e97f.png"
            }
        },
        {
            "title": "ASP.NET 5: How to Get Your Cheese Back",
            "description": "ASP.NET 5 is the new kid on the block, and it's here with a lot of new, unfamiliar features and concepts. As a developer, it's not yet clear why to start developing on ASP.NET 5 or, more importantly, why to move an existing, healthy project to it. I hear a lot of Questions like: 'wow, it wasn't like that before, why has it changed?' 'I'm not familiar with these concepts, so should I stick with [the thing that I am using now]?'. In this talk, I'll cover the reasons why you should start considering ASP.NET 5 by boiling it down to the tried-and-tested format: 10 top features. We'll cover everything from new project structures to unified MVC and Web API frameworks, complete with samples and clear explanations of how these things are going to affect the way you code and the way you build projects. Along the way, we'll cover other little gems like the new Configuration framework. By the end of the talk, the advantages - and potential pitfalls - of using ASP.NET 5 in terms of both runtime and development process should be crystal clear, and you'll be able to work out when's the right time to start using the latest shiny Microsoft bits.",
            "tags": [
                "aspnet-5", 
                "http", 
                "web", 
                "dotnet"
            ],
            "author": {
                "firstname": "Tugberk",
                "lastaname": "Ugurlu",
                "twitter": "@tourismgeek",
                "blog": "http://tugberkugurlu.com",
                "bio": "I am a web guy, Microsoft MVP and software developer specialized mainly on .NET Web technologies. I've worked at the tourism industry to build tourism software services and products for long time and now, I am working at Redgate Software as a Software Engineer helping people do database delivery in a joyful way. I am also a very involved member in the community and try my way to expose my knowledge to others through my blog, webcasts, authoring books, giving talks on various topics and so on. I live in lovely and green Cambridge, UK and I am married to a lovely woman.",
                "avatarUrl": "http://mvp.microsoft.com/private/en-us/PublicProfile/Photo/4039968"
            }
        },
        {
            "title": "Going Further with ASP.NET 5",
            "description": "After getting to know ASP.NET 5, and seeing where it’s different from previous versions, it's time to master the next development framework! If you want to go a little further and look under the hood of ASP.NET 5, this session will be for you. In this talk, I will cover the more advanced features shipping in as part of the new ASP.NET, like language extensibility, hosting, and in-memory end-to-end testing with samples. We’ll also have a chance to see some end-to-end project examples, demonstrating how your workflows and coding might change, and some corner case issues and gotchas you might hit. Generally, this talk will broaden your understanding  of what will be possible with ASP.NET 5, and you’ll know where to look if you want to get one step closer to mastery.",
            "tags": [
                "aspnet-5", 
                "http", 
                "web", 
                "dotnet"
            ],
            "author": {
                "firstname": "Tugberk",
                "lastaname": "Ugurlu",
                "twitter": "@tourismgeek",
                "blog": "http://tugberkugurlu.com",
                "bio": "I am a web guy, Microsoft MVP and software developer specialized mainly on .NET Web technologies. I've worked at the tourism industry to build tourism software services and products for long time and now, I am working at Redgate Software as a Software Engineer helping people do database delivery in a joyful way. I am also a very involved member in the community and try my way to expose my knowledge to others through my blog, webcasts, authoring books, giving talks on various topics and so on. I live in lovely and green Cambridge, UK and I am married to a lovely woman.",
                "avatarUrl": "http://mvp.microsoft.com/private/en-us/PublicProfile/Photo/4039968"
            }
        },
        {
            "title": "React.js in a real world application",
            "description": "React.js is the new kid in the world of frontend frameworks. A brief introduction on what it is and how we are using it in a real world application",
            "tags": [
                "javascript",
                "facebook",
                "frontend",
                "nodejs"
            ],
            "author": {
                "firstname": "Emanuele",
                "lastaname": "DelBono",
                "twitter": "@emadb",
                "bio": "I’m web developer passionate about programming languages. I work in a software house based in Italy where I develop web applications in C#, Ruby and Javascript and hopefully Elixir. I strive for good design, clean code and software that make this world a little better.",
                "avatarUrl": "https://avatars2.githubusercontent.com/u/276876"
            }
        },
    ]
}
